#ifndef INSPECTIONDATA_HPP
#define INSPECTIONDATA_HPP

#include <QDomDocument>
#include <QFile>
#include <QTextStream>
#include <sqlite3.h>

#include "./board.hpp"

using namespace std;

namespace Job
{
    class InspectionData
    {
    public:
        //>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        //构造 & 析构函数
        //初始化成员变量
        InspectionData();

        ~InspectionData();
        //<<<----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

        //>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        //访存函数
        //设置 & 获取 程式的版本号
        void setVersion(std::string version){this->m_version = version;}
        std::string version(){return this->m_version;}

        //设置 & 获取程式最后一次编辑时间
        void setLastEditingTime(std::string time){this->m_lastEditingTime = time;}
        std::string lastEditingTime(){ return this->m_lastEditingTime;}

        //设置 & 获取board信息
        void setBoard(Job::Board * board){ this->m_pBoard = board;}
        Job::Board * pBoard(){return this->m_pBoard;}
        //<<<----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

        //>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        //成员函数
        /*
        *  @brief   writeToXml
        *           将检测程式的信息写入至xml文件中,具体信息如下
        *           检测程式的版本
        *           检测程式对应基板的名称,原点x ,y坐标,及长和宽
        *           基板中所有元件的名称,x,y轴坐标,及长和宽
        *  @param   path : 写入文件的路径 (如 :"test.xml")
        *  @return  N/A
        */
        void writeInspectionDataToXml(QString path);

        void readFromJob(string path);

        void convertFromV1(sqlite3 & sqlite);
        //<<<----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

    private:
        //>>>----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
        //成员变量
        std::string m_version;          //检测程式的版本
        Job::Board * m_pBoard;          //检测基板对象(包含基板信息&检测对象信息)
        std::string m_lastEditingTime;  //记录最后一次保存时间
        //<<<----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

    };
}


#endif // INSPECTIONDATA_HPP
